app/controllers/projects_controller.rb

SELECT  "projects".* FROM "projects" WHERE (start_date <= '2017-10-12' and (end_date > '2017-10-12' or end_date is null))  ORDER BY start_date, title LIMIT 10 OFFSET 0
---
    def index
        @active_projects = Project.active.chronological.alphabetical.paginate(page: params[:page]).per_page(10)

SELECT "projects".* FROM "projects" WHERE (start_date <= '2017-11-01' and (end_date > '2017-11-01' or end_date is null))
---
    def categories
        @categories = Project.all.map{|p|p.category}.sort

SELECT "projects".* FROM "projects"
---
    def genre
        @categories = Project.all.map{|p|p.genre}.sort

INSERT INTO "projects" ("proj_description", "genre", "title", "category", "start_date") VALUES (?, ?, ?, ?, ?)  [["proj_description", "description"], ["genre", "genre"], ["title", "newbook"], ["category", "category"], ["start_date", "2017-10-05"]]
---
    def create
        @project = Project.new(project_params)
        @project.start_date = Date.today
        @project.owner = @current_user  # set the owner to the user who created the project

        if @project.save