app/controllers/users_controller.rb

SELECT  "users".* FROM "users"  ORDER BY first_name LIMIT 7 OFFSET 0
---
	def index
		@users = User.alphabetical.paginate(:page => params[:page]).per_page(7)

SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND (start_date <= '2017-10-26' and (end_date > '2017-10-26' or end_date is null))  ORDER BY start_date  [["user_id", 2]]
SELECT "user_roles".* FROM "user_roles" WHERE "user_roles"."user_id" = ?  [["user_id", 2]]
---
	def show
		@user_projects = @user.projects.active.chronological
		@project_roles = @user.user_roles.map{r|r.name}.sort